app/views/order/index.html.erb

            <tbody>
              <% Order.all.each do |o| %>
---
SELECT "orders".* FROM "orders"