app/controllers/vendor_controller.rb

	def show
		vendor = Vendor.find_by(name: params[:name])
		if vendor.present?
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."name" = $1 LIMIT $2  [["name", "index"], ["LIMIT", 1]]
SELECT "vendors".* FROM "vendors"